In [103]:
# === 01_request.ipynb ================================================
# =====================================================================
# Realizar as tarefas solicitadas pelo departamento de vendas
# Uso de pandas para manipulação dos dados

In [106]:
# === Bibliotecas =========
import pandas as pd

In [105]:
"""
O time de vendas solicitou um relatório para entender o desempenho de vendas por região. Eles pedem:

Um arquivo contendo:

ID do Cliente

Nome do Cliente

Região

Total gasto por cliente

Os dados devem estar agregados por cliente e ordenados pelo maior total gasto.

"""

'\nO time de vendas solicitou um relatório para entender o desempenho de vendas por região. Eles pedem:\n\nUm arquivo contendo:\n\nID do Cliente\n\nNome do Cliente\n\nRegião\n\nTotal gasto por cliente\n\nOs dados devem estar agregados por cliente e ordenados pelo maior total gasto.\n\n'

In [107]:
# Lendo o dataset
df = pd.read_csv(r"..\data\processed\dataset_processed.csv")

In [111]:
# Verificando se os dados estão corretos
df.head()

  ID_Cliente Nome_Cliente  Idade Região Data_Compra  Valor_Compra     Produto
0      C0001    Cliente 1     58  Norte  2023-01-26        296.25  Produto 17
1      C0001    Cliente 1     58  Norte  2023-09-29         87.14  Produto 17
2      C0001    Cliente 1     58  Norte  2023-02-11        427.16   Produto 3
3      C0001    Cliente 1     58  Norte  2023-11-01         43.30   Produto 8
4      C0001    Cliente 1     58  Norte  2023-07-26         68.74  Produto 19

In [112]:
df_agregado = df.groupby(["ID_Cliente","Nome_Cliente", "Região"], as_index=False)["Valor_Compra"].sum() # Agregando as colunas

In [ ]:
df_sorted = df_agregado.sort_values(by="Valor_Compra", ascending=False) # Ordenando pelo maior valor de compra

In [115]:
df_sorted.head()

    ID_Cliente Nome_Cliente Região  Valor_Compra
163      C0098   Cliente 98    Sul      13393.00
12       C0007    Cliente 7  Leste      13365.56
57       C0034   Cliente 34    Sul      12341.26
76       C0045   Cliente 45  Norte      12145.28
129      C0079   Cliente 79  Leste      12096.07

In [116]:
df_sorted.to_csv("../data/processed/sales_request.csv", index=False)